Revit 2027 API
ParameterTypeId.RbsElecRoomLightingCalcWorkplane Property
 "Lighting Calculation Workplane"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecRoomLightingCalcWorkplane { get; }
Public Shared ReadOnly Property RbsElecRoomLightingCalcWorkplane As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecRoomLightingCalcWorkplane {
	ForgeTypeId^ get ();
}
static member RbsElecRoomLightingCalcWorkplane : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace